export type ScheduleItem = {
  id: string | number;
  time: string;
  title: string;
  description?: string;
};

export const HOME_SCHEDULE_SECTION = {
  title: "Програма фестивалю",
};

export const HOME_SCHEDULE: ScheduleItem[] = [
  {
    id: 1,
    time: "10:00–11:00",
    title: "реєстрація, нетворкінг, nail-market",
  },
  {
    id: 2,
    time: "11:00–11:30",
    title: "Ангеліна Рагоза",
    description:
      "«ЕКСПРЕС-НАРОЩУВАННЯ: техніка, яку всі шукають. Дизайн, який хочуть клієнти»",
  },
  {
    id: 3,
    time: "11:40–12:10",
    title: "Галина Орябінська",
    description: "«Кар'єра майстра: неочевидна ціна росту»",
  },
  {
    id: 4,
    time: "12:20–12:50",
    title: "Дарья Shark",
    description: "Від холодного клієнта до фаната вашого бренду",
  },
  {
    id: 5,
    time: "13:00–13:30",
    title: "Олеся Кушнірук",
    description:
      "«З якими станами майстер може працювати сам, а коли вже потрібен подолог. Якщо працюємо, то як!?»",
  },
  {
    id: 6,
    time: "13:40–15:00",
    title: "Перерва",
  },
  {
    id: 7,
    time: "15:00–15:30",
    title: "(тема уточняється)",
  },
  {
    id: 8,
    time: "15:40–16:10",
    title: "Народний спікер",
  },
  {
    id: 9,
    time: "16:20–16:50",
    title: "Judi",
    description:
      "«Майстер-клас: техніка відновлення/реставрації квадрату та апаратний манікюр»",
  },
  {
    id: 10,
    time: "17:00–18:00",
    title: "Перерва",
  },
  {
    id: 11,
    time: "18:00–18:50",
    title: "Юлия Зварич",
    description:
      "«Токсичні відносини з роботою» або «Міряємося-пісями»",
  },
  {
    id: 12,
    time: "19:00–19:20",
    title: 'Оголошення переможців конкурсу «Битва Майстрів» та розіграш МЕГА-подарунків',
  },
];
