import { Section } from "@/blocks/ui/section";
import { Button } from "@/components/ui/button";
import { DecorativeImage } from "@/components/ui/decorative-image";
import { FooterInfoSection } from "@/features/footer-info-section";
import { IMAGES } from "@/shared/const";
import { MomentIcon, NailIcon } from "@/shared/icons";
import { StepBack } from "lucide-react";
import Link from "next/link";

export default function RegulaminKonkursu() {
  return (
    <main className="w-full max-w-4xl shadow-2xl overflow-hidden mx-auto bg-blue-background grow min-h-[100dvh] flex flex-col">
      <Section className="flex flex-col relative items-center justify-start pt-44 pb-10">
        <DecorativeImage
          src={IMAGES.ORANGES_URL}
          className="-left-14 -top-5 md:-left-6 md:-top-5 rotate-[30deg] size-[200px] z-0"
        />
        <DecorativeImage
          src={IMAGES.LEMONS_URL}
          className="-right-8 md:-right-2 -top-8 size-[180px]"
        />
        <span className="flex w-[358px] h-[117px] gap-3.5 flex-col items-center justify-center mb-10">
          <NailIcon />
          <span className="relative block">
            <MomentIcon />
            <img
              src={IMAGES.LEMON_URL}
              alt="O"
              className="absolute left-[67px] top-[-12px] size-[62px] object-cover inline-block"
            />
          </span>
        </span>
      </Section>

      <Section className="px-6 md:px-10 lg:px-16 pb-16 grow">
        <h1 className="text-3xl md:text-4xl font-semibold text-blue-foreground text-center mb-8 pb-4 border-b">
          УМОВИ УЧАСТІ У КОНКУРСІ “БИТВА МАЙСТРІВ”
        </h1>

        <div className="space-y-6 text-blue-foreground/90 text-base leading-relaxed">
          <p className="text-lg italic text-center">
            Привіт! Ти майстер манікюру та любиш свою справу? <br />
            “Битва майстрів” — це конкурс, на якому найкращі майстри манікюру
            зможуть продемонструвати свою майстерність, креативність та техніку
            виконання. Показати всі свої скіли та забрати головний приз 2000
            злотих.
          </p>

          <div className="p-4 border border-blue-foreground rounded-lg">
            <p className="font-semibold text-center text-lg">УВАГА:</p>
            <p className="text-center">
              ФІНАЛ КОНКУРСУ “БИТВА МАЙСТРІВ” ВІДБУДЕТЬСЯ У МІСТІ ВРОЦЛАВ{" "}
              <span className="font-bold">27 ЛИПНЯ 2025 РОКУ</span> НА
              NAIL-ФЕСТИВАЛІ “NAIL MOMENT. ІТАЛІЙСЬКЕ ЛІТО”.
            </p>
          </div>

          <h2 className="text-2xl font-semibold text-blue-foreground mt-8 pt-4 border-t border-white/20">
            ЯК ВЗЯТИ УЧАСТЬ У КОНКУРСІ
          </h2>
          <p>
            Для участі у конкурсі потрібно купити квиток на фестиваль (Standart
            або VIP) та додатково придбати квиток Учасника конкурсу “Битва
            майстрів” через офіційний сайт фестивалю. Один квиток Учасника
            конкурсу “Битва майстрів” дає право участі в 1 (одній) номінації.
            Для участі одного майстра в кількох номінаціях необхідно придбати на
            кожну номінацію окремий квиток Учасника конкурсу “Битва майстрів”.
          </p>
          <p className="font-bold text-destructive">
            КВИТКИ УЧАСНИКІВ НЕ ПІДЛЯГАЮТЬ ПОВЕРНЕННЮ, НЕЗАЛЕЖНО ВІД РЕЗУЛЬТАТІВ
            ВІДБІРКОВОГО ТУРУ АБО МОЖЛИВОСТІ ВІДВІДУВАННЯ ФЕСТИВАЛЮ.
          </p>
          <p>
            Придбаваючи квиток, ви підтверджуєте, що ознайомилися з УМОВАМИ
            КОНКУРСУ “БИТВА МАЙСТРІВ” і повністю їх приймаєте.
          </p>

          <h2 className="text-2xl font-semibold text-blue-foreground mt-8 pt-4 border-t border-white/20">
            ЕТАПИ КОНКУРСУ
          </h2>
          <p>КОНКУРС СКЛАДАЄТЬСЯ З ДВОХ ТУРІВ: ВІДБІРКОВОГО ТА ФІНАЛЬНОГО.</p>

          <h3 className="text-xl font-semibold text-blue-foreground mt-6">
            ВІДБІРКОВИЙ ТУР
          </h3>
          <ul className="list-disc space-y-2 pl-5">
            <li>
              Участь може взяти будь-який бажаючий майстер, який придбав квиток
              STANDART або VIP.
            </li>
            <li>
              Для участі потрібно придбати квиток Учасника конкурсу “Битву
              майстрів”.
            </li>
            <li>
              Відбірковий тур включає 6 номінацій. Один квиток — одна номінація
              (можна приймати участь у всіх номінаціях, тільки на кожну
              номінацію — нова робота).
            </li>
            <li>
              Приймаються 1–3 фото однієї роботи на руках моделі (не на типсах){" "}
              <span className="font-bold">до 20 червня 2025</span> через
              telegram Nail Mоment. (Посилання буде надано додатково).
            </li>
            <li>
              Фотографії повинні відповідати темі номінації, мати гарну якість.
              Протягом 48 годин у робочі дні адміністратори конкурсу
              підтверджують прийняття фотографій до номінації, або пропонують
              надати інші фотографії, якщо отримані фотографії не відповідають
              тематиці номінації або мають погану якість, яка не дає змоги
              оцінити рівень роботи майстра.
            </li>
            <li>
              У кожній номінації буде обрано 20 найкращих робіт. Якщо в
              номінацію надійде кількість робіт менше 20, то на голосування
              відбіркового туру будуть представлені всі роботи номінації.
            </li>
            <li>
              Голосування пройде в чат-боті „Nail Moment. Битва майстрів”
              (посилання буде надано в інстаграмі в день номінацій), в якому
              кожен охочий зможе проголосувати за 1 (одну) вподобану роботу в
              номінації. 3 (три) роботи, що набрали більшість голосів, проведуть
              своїх майстрів у фінал конкурсу.
            </li>
            <li>
              Голосування проводиться по одній номінації на два дні. Тобто на
              голосування в одній номінації відводиться 48 годин. Розклад
              голосування буде опубліковано на сторінці @nail_moment_pl в
              Інстаграмі і в телеграм каналі Nail Moment 1 червня 2025 року.
            </li>
            <li>
              Якщо Учасник конкурсу у ВІДБІРОЧНОМУ ТУРІ посідає перші місця в
              кількості номінаціях, то місце у ФІНАЛЬНОМУ ТУРІ він посідає на
              підставі тієї переможної роботи, яку він відправив першою. У
              другій і наступних номінаціях місця у ФІНАЛЬНОМУ ТУРІ, що
              &quot;вивільнилися&quot;, віддаються Учасникам конкурсу, які
              посіли 4 місця у відповідних номінаціях. Участь у кількох
              номінаціях підвищує шанси пройти у ФІНАЛЬНИЙ ТУР.
            </li>
            <li>
              Якщо Учасник конкурсу відмовляється від участі у ФІНАЛЬНОМУ ТУРІ,
              то його призове місце віддається Учаснику конкурсу, який посів 4
              місце у відповідній номінації.
            </li>
            <li>
              Якщо в номінацію буде подано три, дві або одна робота, то Учасники
              даної номінації автоматично проходять у ФІНАЛ.
            </li>
            <li>
              Так з кожної номінації ми отримаємо по 3 фіналісти! А всього це
              буде <span className="font-bold">18 фіналістів</span> (по 3 з 6
              номінацій), які отримають шанс поборотися за кубок Конкурсу Битва
              Майстрів, чек на <span className="font-bold">2000 злотих</span> та
              бокс на суму <span className="font-bold">2000 зл</span> від
              спонсору заходу Edlen Profesional! А ми отримаємо незрівнянне
              задоволення вболівати за них і стежити за їхньою роботою у фіналі
              &quot;Битви майстрів&quot;!
            </li>
          </ul>

          <h3 className="text-xl font-semibold text-blue-foreground mt-6">
            ФІНАЛЬНИЙ КОНКУРС «БИТВА МАЙСТРІВ»
          </h3>
          <ul className="list-disc space-y-2 pl-5">
            <li>
              Відбудеться <span className="font-bold">27 липня 2025</span> на
              фестивалі Nail Moment у місті Вроцлав.
            </li>
            <li>
              Підбиття підсумку голосування, оголошення Переможця конкурсу,
              відбудеться перед закриттям фестивалю Nail Moment.
            </li>
          </ul>
          <p>
            У фіналі &quot;Битви майстрів&quot; 18 майстрів вперше побачать
            моделей, яких ми заздалегідь відберемо за одним критерієм -
            занедбані РУКИ (складна форма нігтів, непроста кутикула, загалом ми
            спробуємо знайти щось &quot;цікаве&quot;). Учасник конкурсу шляхом
            жеребкування витягує один номер з 9 (9 моделей — по 2 майстра на
            кожну модель), який заздалегідь привласнений моделі, таким чином
            модель запрошується до Учасника конкурсу за витягнутым ним номером.
          </p>
          <p>
            Суть фіналу - <span className="font-bold">ПЕРЕТВОРЕННЯ!</span>{" "}
            однієї руки за <span className="font-bold">2 години 30 хвилин</span>
            . Можна нарощувати, ліпити, розмальовувати — головне: щоб потім було
            мега перевтілення і всі сказали “це не її рука!”. Хоча до такої
            реакції ми будемо готові, адже перетворювати потрібно тільки ОДНУ
            руку! І на це ми даємо 2,5 години часу!!! Перетворення має бути
            продуманим, без перегонів і помилок!
          </p>

          <h4 className="text-lg font-semibold text-blue-foreground mt-4">
            ЗАБОРОНЕНО У ФІНАЛІ:
          </h4>
          <ul className="list-disc space-y-1 pl-5 text-destructive">
            <li>ВИКОРИСТОВУВАТИ ЗАЗДАЛЕГІДЬ ЗРОБЛЕНІ ЗАГОТОВКИ РОБОТИ!</li>
            <li>Кріпити на нігті заздалегідь розписані тіпси.</li>
            <li>
              Кріпити на нігті заздалегідь зроблені об&apos;ємні елементи
              дизайну (фігурки, ліплення тощо). Будь-яке ліплення може
              здійснюватися тільки в реальному часі у фіналі!
            </li>
            <li>
              Використовувати заздалегідь підготовлені молди (заполімеризовані
              частково або повністю)!
            </li>
            <li>
              Використовувати заздалегідь підготовлені заготовки дизайну
              (просушені на повітрі, заполімеризовані тощо). Весь дизайн має
              бути створений вручну в реальному часі за робочим столом у фіналі
              &quot;Битви майстрів&quot;.
            </li>
            <li>
              Заборонено використовувати будь-які елементи декору, зроблені
              заздалегідь з усіх видів гелів, гель-лаків, полігелів (будь-яких
              полімерів), а також акрилу.
            </li>
            <li>Заборонено використовувати плівки та слайдери.</li>
            <li>
              Заборонено використовувати готові дизайнерські композиції на
              металевій основі, що мають декоративні елементи у вигляді
              вензелів, 3D квітів, страз та інші готові композиції.
            </li>
          </ul>

          <h4 className="text-lg font-semibold text-blue-foreground mt-4">
            ДОЗВОЛЕНО У ФІНАЛІ:
          </h4>
          <ul className="list-disc space-y-1 pl-5">
            <li>
              Будь-які манікюрні матеріали для створення дизайнів і декору
              (включаючи об&apos;ємний).
            </li>
            <li>
              Будь-які декоруючі елементи, що не являють собою готову
              композицію, а саме: стрази, тканини, бульонки, блискітки, фольга,
              стемпінг і т.д.
            </li>
            <li>
              Будь-які готові елементи 3-д дизайну, що не вводять в оману, чи
              створені вони вручну майстром або підготовлені заздалегідь, а
              саме: каблучки, ланцюжки та інше. Те, що однозначно купується
              готове і прикріплюється на нігті.
            </li>
            <li>
              Дозволено використовувати молди, які готуються в реальному часі у
              фіналі &quot;Битви майстрів&quot;.
            </li>
            <li>
              Дозволено застосовувати тіпси для моделювання нігтів, проте вони
              мають бути прозорими, і не нести в собі жодної декоративної
              добавки до роботи.
            </li>
          </ul>
          <p>
            Уся робота має бути створена &quot;в полі&quot;, включно з
            манікюром, моделюванням (якщо воно входить у плани майстра),
            дизайном і декоруванням! Будь-яка деталь роботи має бути створена в
            реальному часі у фіналі &quot;Битви майстрів&quot;.
          </p>
          <p>
            Під час фінального етапу Учасник конкурсу використовує тільки своє
            обладнання та свої матеріали, включно з розхідниками. Організатори
            надають лише стіл, два стільці та подовжувач.
          </p>

          <h4 className="text-lg font-semibold text-blue-foreground mt-4">
            ПРЕЗЕНТАЦІЯ РОБОТИ У ФІНАЛІ
          </h4>
          <p>
            Фінальна робота &quot;Перевтілення&quot; закінчується презентацією
            Учасником конкурсу своєї роботи. Презентація включає в себе відео не
            більше 15 секунд. На відео потрібно показати руку ДО, руку ПІСЛЯ (за
            бажанням можна вставити кадри роботи, можна використовувати будь-яке
            тло і реквізит), а також три фінальні фотографії:
          </p>
          <ol className="list-decimal space-y-1 pl-5">
            <li>Рука ДО.</li>
            <li>Рука ДО + рука ПІСЛЯ в одному фото.</li>
            <li>
              Рука ПІСЛЯ як окрема робота (з використанням фону, світла,
              реквізиту).
            </li>
          </ol>
          <p>
            Презентацію роботи виконує сам Учасник конкурсу, використовуючи
            будь-яку техніку, аксесуари, будь-яку програму і обов&apos;язково
            свою фантазію! На зйомку виділяється{" "}
            <span className="font-bold">30 хвилин</span> та на створення
            Презентації відводиться також додаткові{" "}
            <span className="font-bold">30 хвилин</span> (не входить у 2,5
            години робочого часу).
          </p>
          <p>
            У презентаційне відео Учасник конкурсу може включати будь-які кадри,
            які, на його думку, будуть цікаві та зможуть привернути інтерес до
            його роботи. Це можуть бути кадри роботи самого Перевтілення, які
            Учасник конкурсу самостійно знімає в моменті. Фінальний результат
            може бути представлений на будь-якому фотофоні, з використанням
            будь-яких стилів і будь-якого декору. Не забудь приділити увагу
            музичному супроводу. Твори і роби так, щоб твою роботу помітили!
          </p>
          <p>
            Після закінчення прийому робіт організатори конкурсу публікують всі
            роботи в телеграм-боті &quot;Nail Moment. Битва Майстрів&quot;.
            Голосування пройде в чат-боті &quot;Nail Moment&quit;. Битва
            майстрів» серед учасників фестивалю &quot;Nail Moment&quot;.
            Проголосувати за роботу можна тільки маючи вхідний квиток на
            фестиваль.
          </p>
          <p>
            Переможець &quot;Битви майстрів&quot; буде названий наприкінці
            фестивалю &quot;Nail Moment&quot; за підсумками голосування! Там же
            кубок Переможця конкурсу Битва Майстів знайде свого володаря! А вся
            nail-тусовка &quot;Nail Moment&quot; (після привітання переможця,
            звісно, і всіх учасників фіналу &quot;Битви майстрів&quot;)
            продовжить веселитися за на терасі локації на afterparty!
          </p>

          <h2 className="text-2xl font-semibold text-blue-foreground mt-8 pt-4 border-t border-white/20">
            ТЕРМІНИ
          </h2>
          <ul className="list-disc space-y-2 pl-5">
            <li>
              <span className="font-bold">1 травня 2025 року</span> - старт
              прийому робіт у ВІДБІРОЧНИЙ тур.
            </li>
            <li>
              <span className="font-bold">20 червня 2025 року</span> - останній
              день прийому робіт.
            </li>
            <li>
              <span className="font-bold">25 червня 2025 року</span> - старт
              голосування в номінаціях ВІДБІРОЧНОГО ТУРУ.
            </li>
            <li>
              <span className="font-bold">6 липня 2025 року</span> - останній
              день голосування в останній номінації ВІДБІРОЧНОГО ТУРУ.
            </li>
            <li>
              <span className="font-bold">27 липня 2025 року</span> - фінальний
              етап і запуск голосування за фінальні роботи. Підбиття підсумків
              голосування та нагородження переможця!
            </li>
          </ul>
        </div>

        <Button
          className="text-blue-foreground text-center w-full max-w-80 mx-auto mt-10 flex gap-2 items-center"
          asChild
        >
          <Link href="/battle">
            <StepBack />
            Повернутися на головну сторінку Битви Майстрів
          </Link>
        </Button>
      </Section>
      <FooterInfoSection />
    </main>
  );
}
