import { IMAGES } from "@/shared/const";

export const HOME_INFO_CONTENT = {
  introTitle:
    "Фестиваль де новачки можуть навчитися, професіонали РОЗВИВАТИСЯ ТА БУДУВАТИ КАРʼЄРУ",
  introBullets: [
    "збираємо топів nail-індустрії в одному місці. Ніякої води, тільки АКТУАЛЬНІ ТЕМИ ТА МК!",
    "обʼєднуємо майстрів манікюру та педикюру з усієї Європи",
    "запалюємо нові зірки серед майстрів",
    "даємо доступ до ТОПовиих знань, інновацій та можливостей для зростання",
  ],
  mottoTitle: "NAIL MOMENT - це місце сили, знань та можливостей!",
  mottoBullets: [
    "Ми підтримуємо нейл-майстрів, допомагаємо їм будувати успішний бізнес.",
    "Ми створюємо середовище, де кожен може навчатися, надихатися та знайомитися з однодумцями.",
    "Ми розвиваємо індустрію нігтьового сервісу в Польщі та виводимо її на новий рівень.",
  ],
  heroImage: IMAGES.HERO_MAIN,
  warsawCard: {
    title: ["Ми повертаємось", "до Варшави"],
    description:
      "Ви казали, що це найзручніше місто для фестивалю. Ми чуємо та прислуховуємося до наших людей.",
    imageUrl: IMAGES.WARSAW_PHOTO,
    decorUrl: IMAGES.HERO_LOGO_1,
  },
  marketTitle: "Nail-МАРКЕТ від Nail Moment. Твій ідеальний день для шопінгу!",
  marketCards: [
    {
      url: IMAGES.MARKET_1,
      caption:
        "Найкращі nail-бренди в одному місці. Гелі, лаки, бази, дизайни та аксесуари - все, що потрібно майстру.",
    },
    {
      url: IMAGES.MARKET_2,
      caption:
        "Акції, від яких хочеться скупити все. Та безпрограшні лотереї.",
    },
  ],
  boxopad: {
    url: IMAGES.BOXOPAD,
    title: "«БОКСОПАД»",
    description:
      "розіграші боксів з продукцією від провідних брендів",
  },
  whyAttendTitle: "Чому не можна пропустити",
  whyAttendItems: [
    {
      url: IMAGES.WHY_ATTEND_1,
      caption: "Супервигода, яку не знайдеш в онлайні",
    },
    {
      url: IMAGES.WHY_ATTEND_2,
      caption: "Живе спілкування, нові знайомства та натхнення",
    },
    {
      url: IMAGES.WHY_ATTEND_3,
      caption: "Подарунки та емоції, які залишаться з тобою надовго",
    },
  ],
};
